JesseChan5171/STM32-Base/lab4/lab4.1/User/main.c
#include "stm32f10x.h"
#include "IERG3810_LED.h"
#include "IERG3810_Buzzer.h"
#include "IERG3810_KEY.h"
#include "IERG3810_USART.h"
#include "IERG3810_Clock.h"
#include "FONT.H"
#include "SevenSegments.h"
#include "CFONT.H"

void IERG3810_clock_tree_init(void);
void IERG3810_USART2_init(u32, u32);
void IERG3810_USART1_init(u32, u32);
void Delay(u32);
void USART_print(u8, char *);

void Delay(u32 count){
	u32 i;
	for(i = 0; i < count; i++);
}

void IERG3810_key2_ExtInit(){
	RCC->APB2ENR |= 1 << 6;
	GPIOE ->CRL &= 0xFFFFF0FF;
	GPIOE ->CRL |= 0x00000800;
	GPIOE ->BSRR = 1 << 2;
	RCC->APB2ENR |= 0x01;  
	AFIO ->EXTICR[0] &= 0xFFFFF0FF; 
	AFIO ->EXTICR[0] |= 0x00000400; 
	EXTI ->IMR |= 1 << 2;  
	EXTI ->FTSR |= 1 << 2; 
	//EXTI ->RTSR |= 1 << 2; 
	
	NVIC ->IP[8] = 0x65;  
	NVIC ->ISER[0] &= ~(1 << 8);	 
	NVIC ->ISER[0] |= (1 << 8);	 
	
}

void IERG3810_NVIC_SetPriorityGroup(u8 prigroup){
	u32 temp, temp1;
	temp1 = prigroup & 0x00000007;
	temp1 <<= 8; 
	temp = SCB ->AIRCR;
	temp &= 0x0000F8FF;
	temp |= 0x05FA0000;
	temp |= temp1;
	SCB ->AIRCR = temp;
}

void EXTI2_IRQHandler(void){
	u8 i;
	for(i = 0; i < 10; i++){
		GPIOB ->BRR = 1 << 5; 
		Delay(1000000);
		GPIOB ->BSRR = 1 << 5; 
		Delay(1000000);
	}
	EXTI ->PR = 1 << 2; 
}

u32 sheep = 0;
int main(void){
	IERG3810_clock_tree_init();
	//IERG3810_USART2_init(36,9600);
	IERG3810_LED_Init();
	IERG3810_NVIC_SetPriorityGroup(5);
	IERG3810_key2_ExtInit();
	//USART_print(2, "123457890");
	GPIOB ->BSRR = 1 << 5; //DS0 OFF
	
	while(1){
		//USART_print(2, "	---ABCDEF	");
		Delay(5000000);
		GPIOE ->BRR |= 1 << 5; //DS1 ON
		Delay(5000000);
		GPIOE ->BSRR |= 1 << 5;//DS1 OFF
		sheep++;		
	}
}

